In [1]:
import mysql.connector as conn

In [2]:
import logging as lg

In [3]:
lg.basicConfig(filename='C:\\Users\\neeti\\OneDrive\\Desktop\\Logging\\sql_practice.log' , level = lg.INFO,format  = '%(asctime)s %(message)s')

In [4]:
mydb=conn.connect(host='localhost',user='root',passwd="mysql")

In [5]:
cursor=mydb.cursor()

In [6]:
cursor.execute('create database sql_practice')

DatabaseError: 1007 (HY000): Can't create database 'sql_practice'; database exists

In [7]:
cursor.execute('use sql_practice')

In [ ]:
cursor.execute('create table sql_practice.Worker(WORKER_ID INT NOT NULL PRIMARY KEY AUTO_INCREMENT,FIRST_NAME CHAR(25),LAST_NAME CHAR(25),SALARY INT(15),JOINING_DATE DATETIME,DEPARTMENT CHAR(25))')

In [ ]:
cursor.execute('INSERT INTO sql_practice.Worker VALUES(001, "Monika", "Arora", 100000, "14-02-20 09.00.00", "HR"),(002, "Niharika", "Verma", 80000, "14-06-11 09.00.00", "Admin"),(003, "Vishal", "Singhal", 300000, "14-02-20 09.00.00", "HR"),(004, "Amitabh", "Singh", 500000, "14-02-20 09.00.00", "Admin"),(005, "Vivek", "Bhati", 500000, "14-06-11 09.00.00", "Admin"),(006, "Vipul", "Diwan", 200000, "14-06-11 09.00.00", "Account"),(007, "Satish", "Kumar", 75000, "14-01-20 09.00.00", "Account"),(008, "Geetika", "Chauhan", 90000, "14-04-11 09.00.00", "Admin")')

In [49]:
cursor.execute('select * from Worker')

In [50]:
cursor.fetchall()

[(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin')]

### Q-1. Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as &lt;WORKER_NAME&gt;.

In [51]:
cursor.execute('select FIRST_NAME AS WORKER_NAME from Worker')

In [52]:
cursor.fetchall()

[('Monika',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',)]

### Q-2. Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

In [53]:
cursor.execute('select distinct DEPARTMENT from Worker')

In [54]:
cursor.fetchall()

[('HR',), ('Admin',), ('Account',)]

### Q-3. Write an SQL query to show the last 5 record from a table.

In [55]:
cursor.execute('SELECT * FROM Worker W order by W.WORKER_ID DESC limit 5')

In [56]:
cursor.fetchall()

[(8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin')]

### Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

In [57]:
cursor.execute('select substring(FIRST_NAME,1,3) from Worker')

In [58]:
cursor.fetchall()

[('Mon',),
 ('Nih',),
 ('Vis',),
 ('Ami',),
 ('Viv',),
 ('Vip',),
 ('Sat',),
 ('Gee',)]

In [59]:
mydb.commit()

### Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

In [60]:
cursor.execute('select POSITION("a" IN FIRST_NAME) from Worker where FIRST_NAME = "Amitabh"')

In [61]:
cursor.fetchall()

[(1,)]

### Write an SQL query to print the name of employees having the highest salary in each department.

In [62]:
cursor.execute('SELECT FIRST_NAME, LAST_NAME, SALARY, DEPARTMENT FROM Worker WHERE (SALARY,DEPARTMENT) IN (select MAX(SALARY), DEPARTMENT from Worker group by DEPARTMENT)')

In [63]:
cursor.fetchall()

[('Vishal', 'Singhal', 300000, 'HR'),
 ('Amitabh', 'Singh', 500000, 'Admin'),
 ('Vivek', 'Bhati', 500000, 'Admin'),
 ('Vipul', 'Diwan', 200000, 'Account')]

### Write an SQL query to print the FIRST_NAME from Worker table after removing white spaces from the right side.

In [64]:
cursor.execute('select rtrim(FIRST_NAME) from Worker ')

In [65]:
cursor.fetchall()

[('Monika',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',)]

### Write an SQL query that fetches the unique values of DEPARTMENT from Worker table and prints its length.

In [66]:
cursor.execute('select distinct length(DEPARTMENT) from Worker')

In [67]:
cursor.fetchall()

[(2,), (5,), (7,)]

### Write an SQL query to fetch nth max salaries from a table.

In [68]:
#n=6
cursor.execute('select * from Worker order by SALARY desc limit 6,1')

In [69]:
cursor.fetchall()

[(2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin')]

### Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.

In [70]:
cursor.execute('select replace(FIRST_NAME,"a","A") from Worker')

In [71]:
cursor.fetchall()

[('MonikA',),
 ('NihArikA',),
 ('VishAl',),
 ('AmitAbh',),
 ('Vivek',),
 ('Vipul',),
 ('SAtish',),
 ('GeetikA',)]

### Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

In [72]:
cursor.execute('select * from Worker order by FIRST_NAME , DEPARTMENT desc')

In [73]:
cursor.fetchall()

[(4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin'),
 (1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin')]

### Write an SQL query to fetch the names of workers who earn the highest salary.

In [74]:
cursor.execute('select FIRST_NAME, LAST_NAME from Worker where SALARY in (select max(SALARY) from Worker as T)')

In [75]:
cursor.fetchall()

[('Amitabh', 'Singh'), ('Vivek', 'Bhati')]

### Write an SQL query to print details of workers excluding first names, “Vipul” and “Satish” from Worker table.

In [76]:
cursor.execute('select * from Worker where FIRST_NAME not in ("Vipul","Satish")')

In [77]:
cursor.fetchall()

[(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin')]

### Write an SQL query to print details of the Workers whose FIRST_NAME ends with ‘h’ and contains six alphabets.

In [78]:
cursor.execute('select * from Worker where FIRST_NAME like "_____h"')

In [79]:
cursor.fetchall()

[(7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account')]

### Write a query to validate Email of Employee.

In [80]:
cursor.execute('select * from Empl where email_id not like "%_.%_@%_.%_"')

ProgrammingError: 1146 (42S02): Table 'sql_practice.empl' doesn't exist

### Write an SQL query to print details of the Workers who have joined in Feb’2014.

In [81]:
cursor.execute('select * from Worker where JOINING_DATE like "2014-02%_"')

In [82]:
cursor.fetchall()

[(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin')]

### Write an SQL query to fetch duplicate records having matching data in some fields of a table.

In [83]:
cursor.execute('select SALARY,DEPARTMENT,COUNT(*) from Worker group by SALARY, DEPARTMENT having COUNT(*)>1')

In [84]:
cursor.fetchall()

[(500000, 'Admin', 2)]

### How to remove duplicate rows from Employees table.

### Write an SQL query to show only odd rows from a table.

In [85]:
cursor.execute('select * from Worker where MOD(WORKER_ID,2) <> 0')

In [86]:
cursor.fetchall()

[(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account')]

In [88]:
cursor.execute('select * from (select *,ROW_NUMBER() over(order by WORKER_ID) as rn from Worker) as T where MOD(T.rn,2) <> 0')

In [89]:
cursor.fetchall()

[(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR', 1),
 (3,
  'Vishal',
  'Singhal',
  300000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'HR',
  3),
 (5,
  'Vivek',
  'Bhati',
  500000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin',
  5),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account',
  7)]

### Write an SQL query to clone a new table from another table.

In [ ]:
cursor.execute('create table Worker_Clone like Worker')

In [90]:
cursor.execute('select * from Worker_Clone')

In [91]:
cursor.fetchall()

[]

In [92]:
mydb.commit()

### Write an SQL query to fetch intersecting records of two tables.

In [93]:
cursor.execute('CREATE TABLE Title (WORKER_REF_ID INT,WORKER_TITLE CHAR(25),AFFECTED_FROM DATETIME,FOREIGN KEY (WORKER_REF_ID) REFERENCES Worker(WORKER_ID) ON DELETE CASCADE);')

ProgrammingError: 1050 (42S01): Table 'title' already exists

In [ ]:
cursor.execute('INSERT INTO Title (WORKER_REF_ID, WORKER_TITLE, AFFECTED_FROM) VALUES (001, "Manager", "2016-02-20 00:00:00"),(002, "Executive", "2016-06-11 00:00:00"),(008, "Executive", "2016-06-11 00:00:00"),(005, "Manager", "2016-06-11 00:00:00"),(004, "Asst. Manager", "2016-06-11 00:00:00"),(007, "Executive", "2016-06-11 00:00:00"),(006, "Lead", "2016-06-11 00:00:00"),(003, "Lead", "2016-06-11 00:00:00");')
cursor.fetchall()

In [94]:
cursor.execute('select * from Title')

In [95]:
cursor.fetchall()

[(1, 'Manager', datetime.datetime(2016, 2, 20, 0, 0)),
 (2, 'Executive', datetime.datetime(2016, 6, 11, 0, 0)),
 (8, 'Executive', datetime.datetime(2016, 6, 11, 0, 0)),
 (5, 'Manager', datetime.datetime(2016, 6, 11, 0, 0)),
 (4, 'Asst. Manager', datetime.datetime(2016, 6, 11, 0, 0)),
 (7, 'Executive', datetime.datetime(2016, 6, 11, 0, 0)),
 (6, 'Lead', datetime.datetime(2016, 6, 11, 0, 0)),
 (3, 'Lead', datetime.datetime(2016, 6, 11, 0, 0))]

In [96]:
cursor.execute('(select * from Worker) INTERSECT (select * from Title)')

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'INTERSECT (select * from Title)' at line 1

### Write an SQL query to show the top n (say 10) records of a table.

In [97]:
cursor.execute('select * from Worker limit 10')

In [98]:
cursor.fetchall()

[(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin')]

### Write an SQL query to determine the nth (say n=5) highest salary from a table.

In [26]:
cursor.execute('select SALARY from Worker order by SALARY desc limit 4,1')

In [27]:
cursor.fetchall()

[(100000,)]

### Write an SQL query to determine the 5th highest salary without using TOP or limit method.

In [28]:
cursor.execute('select SALARY from Worker Wa where 4=(select count(distinct SALARY ) from Worker Wb where Wb.SALARY<Wa.SALARY)')

In [29]:
cursor.fetchall()

[(200000,)]

### Write an SQL query to fetch the list of employees with the same salary.

In [47]:
cursor.execute('select W1.WORKER_ID,W1.FIRST_NAME,W1.LAST_NAME,W1.SALARY from Worker W1 join Worker W2 on W1.SALARY=W2.SALARY and W1.WORKER_ID!=W2.WORKER_ID')

In [48]:
cursor.fetchall()

[(5, 'Vivek', 'Bhati', 500000), (4, 'Amitabh', 'Singh', 500000)]